zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_XRDC.h
#define XRDC_MDA_W0_6_DFMT0_DIDS_MASK            (0x30U)
#define XRDC_MDA_W0_6_DFMT0_DIDS_SHIFT           (4U)
#define XRDC_MDA_W0_6_DFMT0_DIDS_WIDTH           (2U)
#define XRDC_MDA_W0_6_DFMT0_DIDS(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_DIDS_SHIFT)) & XRDC_MDA_W0_6_DFMT0_DIDS_MASK)

#define XRDC_MDA_W0_6_DFMT0_PE_MASK              (0xC0U)
#define XRDC_MDA_W0_6_DFMT0_PE_SHIFT             (6U)
#define XRDC_MDA_W0_6_DFMT0_PE_WIDTH             (2U)
#define XRDC_MDA_W0_6_DFMT0_PE(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_PE_SHIFT)) & XRDC_MDA_W0_6_DFMT0_PE_MASK)

#define XRDC_MDA_W0_6_DFMT0_PIDM_MASK            (0x3F00U)
#define XRDC_MDA_W0_6_DFMT0_PIDM_SHIFT           (8U)
#define XRDC_MDA_W0_6_DFMT0_PIDM_WIDTH           (6U)
#define XRDC_MDA_W0_6_DFMT0_PIDM(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_PIDM_SHIFT)) & XRDC_MDA_W0_6_DFMT0_PIDM_MASK)

#define XRDC_MDA_W0_6_DFMT0_PID_MASK             (0x3F0000U)
#define XRDC_MDA_W0_6_DFMT0_PID_SHIFT            (16U)
#define XRDC_MDA_W0_6_DFMT0_PID_WIDTH            (6U)
#define XRDC_MDA_W0_6_DFMT0_PID(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_PID_SHIFT)) & XRDC_MDA_W0_6_DFMT0_PID_MASK)

#define XRDC_MDA_W0_6_DFMT0_DFMT_MASK            (0x20000000U)
#define XRDC_MDA_W0_6_DFMT0_DFMT_SHIFT           (29U)
#define XRDC_MDA_W0_6_DFMT0_DFMT_WIDTH           (1U)
#define XRDC_MDA_W0_6_DFMT0_DFMT(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_DFMT_SHIFT)) & XRDC_MDA_W0_6_DFMT0_DFMT_MASK)

#define XRDC_MDA_W0_6_DFMT0_LK1_MASK             (0x40000000U)
#define XRDC_MDA_W0_6_DFMT0_LK1_SHIFT            (30U)
#define XRDC_MDA_W0_6_DFMT0_LK1_WIDTH            (1U)
#define XRDC_MDA_W0_6_DFMT0_LK1(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_LK1_SHIFT)) & XRDC_MDA_W0_6_DFMT0_LK1_MASK)

#define XRDC_MDA_W0_6_DFMT0_VLD_MASK             (0x80000000U)
#define XRDC_MDA_W0_6_DFMT0_VLD_SHIFT            (31U)
#define XRDC_MDA_W0_6_DFMT0_VLD_WIDTH            (1U)
#define XRDC_MDA_W0_6_DFMT0_VLD(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_6_DFMT0_VLD_SHIFT)) & XRDC_MDA_W0_6_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W0_7_DFMT1 - Master Domain Assignment */
/*! @{ */

#define XRDC_MDA_W0_7_DFMT1_DID_MASK             (0x3U)
#define XRDC_MDA_W0_7_DFMT1_DID_SHIFT            (0U)
#define XRDC_MDA_W0_7_DFMT1_DID_WIDTH            (2U)
#define XRDC_MDA_W0_7_DFMT1_DID(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_DID_SHIFT)) & XRDC_MDA_W0_7_DFMT1_DID_MASK)

#define XRDC_MDA_W0_7_DFMT1_PA_MASK              (0x30U)
#define XRDC_MDA_W0_7_DFMT1_PA_SHIFT             (4U)
#define XRDC_MDA_W0_7_DFMT1_PA_WIDTH             (2U)
#define XRDC_MDA_W0_7_DFMT1_PA(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_PA_SHIFT)) & XRDC_MDA_W0_7_DFMT1_PA_MASK)

#define XRDC_MDA_W0_7_DFMT1_SA_MASK              (0xC0U)
#define XRDC_MDA_W0_7_DFMT1_SA_SHIFT             (6U)
#define XRDC_MDA_W0_7_DFMT1_SA_WIDTH             (2U)
#define XRDC_MDA_W0_7_DFMT1_SA(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_SA_SHIFT)) & XRDC_MDA_W0_7_DFMT1_SA_MASK)

#define XRDC_MDA_W0_7_DFMT1_DIDB_MASK            (0x100U)
#define XRDC_MDA_W0_7_DFMT1_DIDB_SHIFT           (8U)
#define XRDC_MDA_W0_7_DFMT1_DIDB_WIDTH           (1U)
#define XRDC_MDA_W0_7_DFMT1_DIDB(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_DIDB_SHIFT)) & XRDC_MDA_W0_7_DFMT1_DIDB_MASK)

#define XRDC_MDA_W0_7_DFMT1_DFMT_MASK            (0x20000000U)
#define XRDC_MDA_W0_7_DFMT1_DFMT_SHIFT           (29U)
#define XRDC_MDA_W0_7_DFMT1_DFMT_WIDTH           (1U)
#define XRDC_MDA_W0_7_DFMT1_DFMT(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_DFMT_SHIFT)) & XRDC_MDA_W0_7_DFMT1_DFMT_MASK)

#define XRDC_MDA_W0_7_DFMT1_LK1_MASK             (0x40000000U)
#define XRDC_MDA_W0_7_DFMT1_LK1_SHIFT            (30U)
#define XRDC_MDA_W0_7_DFMT1_LK1_WIDTH            (1U)
#define XRDC_MDA_W0_7_DFMT1_LK1(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_LK1_SHIFT)) & XRDC_MDA_W0_7_DFMT1_LK1_MASK)

#define XRDC_MDA_W0_7_DFMT1_VLD_MASK             (0x80000000U)
#define XRDC_MDA_W0_7_DFMT1_VLD_SHIFT            (31U)
#define XRDC_MDA_W0_7_DFMT1_VLD_WIDTH            (1U)
#define XRDC_MDA_W0_7_DFMT1_VLD(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_7_DFMT1_VLD_SHIFT)) & XRDC_MDA_W0_7_DFMT1_VLD_MASK)
/*! @} */

/*! @name PDAC_W0 - Peripheral Domain Access Control Word 0 */
/*! @{ */

#define XRDC_PDAC_W0_D0ACP_MASK                  (0x7U)
#define XRDC_PDAC_W0_D0ACP_SHIFT                 (0U)
#define XRDC_PDAC_W0_D0ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D0ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D0ACP_SHIFT)) & XRDC_PDAC_W0_D0ACP_MASK)

#define XRDC_PDAC_W0_D1ACP_MASK                  (0x38U)
#define XRDC_PDAC_W0_D1ACP_SHIFT                 (3U)
#define XRDC_PDAC_W0_D1ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D1ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D1ACP_SHIFT)) & XRDC_PDAC_W0_D1ACP_MASK)

#define XRDC_PDAC_W0_D2ACP_MASK                  (0x1C0U)
#define XRDC_PDAC_W0_D2ACP_SHIFT                 (6U)
#define XRDC_PDAC_W0_D2ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D2ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D2ACP_SHIFT)) & XRDC_PDAC_W0_D2ACP_MASK)

#define XRDC_PDAC_W0_D3ACP_MASK                  (0xE00U)
#define XRDC_PDAC_W0_D3ACP_SHIFT                 (9U)
#define XRDC_PDAC_W0_D3ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D3ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D3ACP_SHIFT)) & XRDC_PDAC_W0_D3ACP_MASK)

#define XRDC_PDAC_W0_SNUM_MASK                   (0xF000000U)
#define XRDC_PDAC_W0_SNUM_SHIFT                  (24U)
#define XRDC_PDAC_W0_SNUM_WIDTH                  (4U)
#define XRDC_PDAC_W0_SNUM(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_SNUM_SHIFT)) & XRDC_PDAC_W0_SNUM_MASK)

#define XRDC_PDAC_W0_SE_MASK                     (0x40000000U)
#define XRDC_PDAC_W0_SE_SHIFT                    (30U)
#define XRDC_PDAC_W0_SE_WIDTH                    (1U)
#define XRDC_PDAC_W0_SE(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_SE_SHIFT)) & XRDC_PDAC_W0_SE_MASK)
/*! @} */

/*! @name PDAC_W1 - Peripheral Domain Access Control Word 1 */
/*! @{ */

